<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"fb9c5a6f12e790765633718e374a14d2fcff6a67390a8814642af3554b027677","plan_job_ref":"Job Create terraform plan #18 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6544486970","plan_hash":"4de2f7d1168637ddfc3c76a05f9cf552d1a0259f6b1ee00c532f6007db717483","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 3 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/16eeffaa411a670a912776f50e880ac1f7ece50754323efa86042684485f4fdf.zip" -> "builds/e6f96e19df493e2a0ede49f0eb345b042940975523fd57997f1938081046153e.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-17T05:27:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:8/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./lambda/rotate_install_token.py",
                      + null,
                    ],
                  + [
                      + "zip",
                      + "./lambda/package/",
                      + null,
                    ],
                ]
              + filename      = "builds/e6f96e19df493e2a0ede49f0eb345b042940975523fd57997f1938081046153e.zip"
              + runtime       = "python3.11"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/e6f96e19df493e2a0ede49f0eb345b042940975523fd57997f1938081046153e.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "*******************" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/16eeffaa411a670a912776f50e880ac1f7ece50754323efa86042684485f4fdf.zip" -> "builds/e6f96e19df493e2a0ede49f0eb345b042940975523fd57997f1938081046153e.zip"
          ~ "timestamp" = "1697478871006104000" -> "1697531017926083000"
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #18](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6544486970)